# LAB API

### In this lab you will choose 3 APIs from the list in the GitHub Repo.
### Create a dataframe of the available data and think of a project that you could do with that data.

## API Nr. 1: City Bikes (https://api.citybik.es/v2/)

In [1]:
# Import requests library
import requests
import json 
import pandas as pd

In [2]:
# Request:

In [3]:
bikes = requests.get('http://api.citybik.es/v2/networks')

results1 = bikes.json()
#results1
print("bikes:", bikes.status_code)

bikes: 200

In [4]:
# Json in Dataframe:

In [5]:
pd.set_option("display.max_rows", 0)

data = pd.DataFrame(results1)
data.head(10)

                                            networks
0  {'company': ['ЗАО «СитиБайк»'], 'href': '/v2/n...
1  {'company': ['Gobike A/S'], 'href': '/v2/netwo...
2  {'company': ['Gobike A/S'], 'href': '/v2/netwo...
3  {'company': ['Urban Infrastructure Partner'], ...
4  {'company': ['Gobike A/S'], 'href': '/v2/netwo...
5  {'company': ['Domoblue'], 'href': '/v2/network...
6  {'company': ['Domoblue'], 'href': '/v2/network...
7  {'company': ['Domoblue'], 'href': '/v2/network...
8  {'company': ['Domoblue'], 'href': '/v2/network...
9  {'company': ['Domoblue'], 'href': '/v2/network...

In [6]:
# Data has to get flattened:

In [30]:
from pandas.io.json import json_normalize

bike_new = results1
flattened_data_bike = pd.json_normalize(bike_new)

flattened_data_bike

flattened_data_bike.head()

                                            networks
0  [{'company': ['ЗАО «СитиБайк»'], 'href': '/v2/...

In [8]:
# the flattening does not work, so I try to get one level deeper into the column 'networks':

In [29]:
from pandas.io.json import json_normalize

bike_new = results1['networks']
flattened_data_bike = pd.json_normalize(bike_new)

flattened_data_bike

flattened_data_bike.head()

,company,href,id,name,location.city,location.country,location.latitude,location.longitude,source,gbfs_href,license.name,license.url,ebikes
0,[ЗАО «СитиБайк»],/v2/networks/velobike-moscow,velobike-moscow,Velobike,Moscow,RU,55.750000,37.616667,NaN,NaN,NaN,NaN,NaN
1,[Gobike A/S],/v2/networks/bycyklen,bycyklen,Bycyklen,Copenhagen,DK,55.673582,12.564984,NaN,NaN,NaN,NaN,NaN
2,[Gobike A/S],/v2/networks/nu-connect,nu-connect,Nu-Connect,Utrecht,NL,52.117000,5.067000,NaN,NaN,NaN,NaN,NaN
3,[Urban Infrastructure Partner],/v2/networks/baerum-bysykkel,baerum-bysykkel,Bysykkel,Bærum,NO,59.894550,10.546343,NaN,NaN,NaN,NaN,NaN
4,[Gobike A/S],/v2/networks/bysykkelen,bysykkelen,Bysykkelen,Stavanger,NO,58.969975,5.733107,NaN,NaN,NaN,NaN,NaN

# API Nr. 2: Trivia (https://opentdb.com/api_config.php)

In [10]:
# Request:

In [11]:
trivia = requests.get("https://opentdb.com/api.php?amount=50")
print("trivia:", trivia.status_code)

results2 = trivia.json()
#results2

trivia: 200

In [12]:
# Json in Dataframe:

In [13]:
pd.set_option("display.max_rows", 0)

data2 = pd.DataFrame(results2)
data2.head(10)

   response_code                                            results
0              0  {'category': 'Mythology', 'type': 'multiple', ...
1              0  {'category': 'Sports', 'type': 'multiple', 'di...
2              0  {'category': 'Entertainment: Video Games', 'ty...
3              0  {'category': 'Science: Computers', 'type': 'bo...
4              0  {'category': 'Animals', 'type': 'boolean', 'di...
5              0  {'category': 'Entertainment: Music', 'type': '...
6              0  {'category': 'History', 'type': 'boolean', 'di...
7              0  {'category': 'Politics', 'type': 'multiple', '...
8              0  {'category': 'Entertainment: Video Games', 'ty...
9              0  {'category': 'Entertainment: Music', 'type': '...

In [14]:
# Data has to get flattened:

In [28]:
trivia = results2
flattened_data_trivia = pd.json_normalize(trivia)

flattened_data_trivia

#flattened_data_trivia.head()

   response_code                                            results
0              0  [{'category': 'Mythology', 'type': 'multiple',...

In [16]:
# the flattening does not work, so I try to get one level deeper into the column 'results':

In [27]:
trivia = results2['results']
flattened_data_trivia = pd.json_normalize(trivia)

flattened_data_trivia

flattened_data_trivia.head()

,category,type,difficulty,question,correct_answer,incorrect_answers
0,Mythology,multiple,hard,"According to Algonquian folklore, how does one...",Participating in cannibalism.,"[Excessive mutilation of animal corpses., Perf..."
1,Sports,multiple,medium,At which bridge does the annual Oxford and Cam...,Putney,"[Hammersmith, Vauxhall , Battersea]"
2,Entertainment: Video Games,multiple,medium,How many Chaos Emeralds can you collect in the...,Six,"[Seven, Five, Eight]"
3,Science: Computers,boolean,medium,The first computer bug was formed by faulty wi...,False,[True]
4,Animals,boolean,medium,"The Ceratosaurus, a dinosaur known for having ...",False,[True]

# API Nr. 3: Quotes (https://pprathameshmore.github.io/QuoteGarden/#get-quotes)

In [18]:
# Request:

In [19]:
quotes = requests.get("https://quote-garden.herokuapp.com/api/v3/quotes")

print("quotes:", quotes.status_code)

quotes: 200

In [20]:
results3 = quotes.json()
#results3

In [21]:
# Json in Dataframe:

In [32]:
pd.set_option("display.max_rows", 0)

data3 = pd.DataFrame(results3)
data3.head(10)

ValueError: Mixing dicts with non-Series may lead to ambiguous ordering.

In [ ]:
# Data has to get flattened:

In [26]:
quotes = results3
flattened_data_quotes = pd.json_normalize(quotes)

flattened_data_quotes

flattened_data_quotes.head()

,statusCode,message,totalQuotes,data,pagination.currentPage,pagination.nextPage,pagination.totalPages
0,200,Quotes,72672,"[{'_id': '5eb17aadb69dc744b4e70d2e', 'quoteTex...",1,2,7268

In [ ]:
# the flattening does not work, so I try to get one level deeper into the column 'data':

In [25]:
quotes = results3['data']
flattened_data_quotes = pd.json_normalize(quotes)

flattened_data_quotes

flattened_data_quotes.head()

,_id,quoteText,quoteAuthor,quoteGenre,__v
0,5eb17aadb69dc744b4e70d2e,"All diseases run into one, old age.",Ralph Waldo Emerson,age,0
1,5eb17aadb69dc744b4e70d36,"Alas, after a certain age every man is respons...",Albert Camus,age,0
2,5eb17aadb69dc744b4e70d44,"When grace is joined with wrinkles, it is ador...",Victor Hugo,age,0
3,5eb17aadb69dc744b4e70d48,Age is not a particularly interesting subject....,Don Marquis,age,0
4,5eb17aadb69dc744b4e70d5e,My notion of a wife at 40 is that a man should...,Warren Beatty,age,0